package anapp.truck.com.anapp.utility;

/**
 * Created by angli on 6/16/15.
 */
public class TruckConst {

    public static final String[] factories = {"东风","福田","一汽解放","青岛解放","陕汽","江淮","重汽","柳汽"
                                                ,"北奔","红岩杰狮","江铃JMC","跃进","庆铃ISUZU","沃尔沃","奔驰","斯卡尼亚"
                                                ,"其他品牌"};
    public static final String[][] truckTypes = {{"天龙","天锦","多利卡","凯普特","锐铃","福瑞卡","小霸王","其它"},
                                                {"欧曼","奥铃","欧马可","时代","其它"}, {"J6","小J6","其它"},
                                                {"JH6","虎威","新大威","赛龙","其它"},
                                                {"德龙","奥龙","其它"}, {"帅铃","骏铃","威铃","好运","格尔发","亮剑","其它"},
                                                {"斯太尔(STR)","汕德卡(SITRAK)","豪沃轻卡","豪沃重卡","黄河","其它"},
                                                {"霸龙","乘龙","乘龙王子","其它"},
                                                {"其它"}, {"其它"}, {"顺达","凯运","凯威","凯锐"},
                                                {"小骏","帅虎","小福星","超越"},
                                                {"100P","600P","700P","FVZ"}, {"其它"}, {"其它"}, {"其它"},
                                                {"其它"}};

    public static final String[] purchaseYears = {"1986","1987","1988","1989","1990","1991","1992","1993","1994","1995",
                                                "1996","1997","1998","1999","2000","2001","2002","2003","2004","2005",
                                                "2006","2007","2008","2009","2010","2011","2012","2013","2014","2015"};

    public static final String[] purchaseMonths = {"1月","2月","3月","4月","5月","6月","7月","8月","9月","10月","11月","12月"};
}
